/* No comment provided by engineer. */
"A destination email address is invalid." = "A destination email address is invalid.";

/* No comment provided by engineer. */
"Email" = "Email";

/* No comment provided by engineer. */
"No destination specified." = "No destination specified.";

/* No comment provided by engineer. */
"Other destinations cannot be empty." = "Other destinations cannot be empty.";

/* No comment provided by engineer. */
"Password cannot be empty if authentication is required." = "Password cannot be empty if authentication is required.";

/* No comment provided by engineer. */
"Send an email notification announcing a new podcast" = "Send an email notification announcing a new podcast";

/* No comment provided by engineer. */
"Sender email address cannot be empty." = "Sender email address cannot be empty.";

/* No comment provided by engineer. */
"SMTP address cannot be empty." = "SMTP address cannot be empty.";

/* No comment provided by engineer. */
"Too many destination emails (maximum is 16)." = "Too many destination emails (maximum is 16).";

/* No comment provided by engineer. */
"Unknown" = "Unknown";

/* No comment provided by engineer. */
"Username cannot be empty." = "Username cannot be empty.";

